def l(w):
    w=("hello world")
    for i in range(10):
        print(w)
# argument == არგუმენტი არის მნიშვნელობა ან ობიექტი, რომელიც გადაეცემა ფუნქციას ან მეთოდს მისი გამოძახებისას. არგუმენტები უზრუნველყოფენ შეყვანის მონაცემებს ფუნქციისთვის მისი დავალების შესასრულებლად.
# კოდის სტრუქტურირება და ორგანიზება კონკრეტული დავალების შესასრულებლად ინსტრუქციების ნაკრების გაერთიანებით
name=input("what is your name? ")
lastname=input("what is your last name? ")
print(f"hi nice to meet you {name} {lastname}")